# Реализовать программу работы с органическими клетками, состоящими из ячеек.
# Необходимо создать класс Клетка. В его конструкторе инициализировать параметр,
# соответствующий количеству ячеек клетки (целое число).
# В классе должны быть реализованы методы перегрузки арифметических операторов:
# сложение (__add__()), вычитание (__sub__()), умножение (__mul__()), деление (__truediv__()).
# Данные методы должны применяться только к клеткам и выполнять увеличение,
# уменьшение, умножение и целочисленное (с округлением до целого) деление клеток,
# соответственно.
# Сложение. Объединение двух клеток.
# При этом число ячеек общей клетки должно равняться сумме ячеек исходных двух клеток.
# Вычитание. Участвуют две клетки.
# Операцию необходимо выполнять только если разность количества ячеек двух клеток больше нуля,
# иначе выводить соответствующее сообщение.
# Умножение. Создается общая клетка из двух.
# Число ячеек общей клетки определяется как произведение количества ячеек этих двух клеток.
# Деление. Создается общая клетка из двух.
# Число ячеек общей клетки определяется как целочисленное деление количества ячеек этих
# двух клеток.
# В классе необходимо реализовать метод make_order(),
# принимающий экземпляр класса и количество ячеек в ряду.
# Данный метод позволяет организовать ячейки по рядам.
# Метод должен возвращать строку вида *****\n*****\n*****...,
# где количество ячеек между \n равно переданному аргументу.
# Если ячеек на формирование ряда не хватает, то в последний ряд записываются все оставшиеся.
# Например, количество ячеек клетки равняется 12, количество ячеек в ряду — 5.
# Тогда метод make_order() вернет строку: *****\n*****\n**.
# Или, количество ячеек клетки равняется 15, количество ячеек в ряду — 5.
# Тогда метод make_order() вернет строку: *****\n*****\n*****.

class Cell:
    def __init__(self, list):
        self.list = list

    def __str__(self):
        return (f'результат метода: {self.list * "*"}')

    def __add__(self, other):
        return Cell(self.list + other.list)

    def __sub__(self, other):
        return Cell(self.list - self.list)

    def __mul__(self, other):
        return Cell(self.list * other.list)

    def __truediv__(self, other):
        return Cell(self.list // other.list)

    def make_order(self, cell_in_row):
        return '\n'.join(['*' * cell_in_row for _ in range(self // cell_in_row)]) + '\n' + '*' * (self % cell_in_row)

my_cell = Cell(10)
my_cell1 = Cell(5)
print(my_cell + my_cell1)
print(my_cell - my_cell1)
print(my_cell * my_cell1)
print(my_cell / my_cell1)
print(Cell.make_order(10, 5)) # не могу разобраться как вывести метод make_order через my_cell
